[Killed] StringLiteral
sd-05-block15-project-react-testing-library/src/components/Pokemon.js:22:44
         <div className="pokemon-overview">
           <p data-testid="pokemon-name">{`${name}`}</p>
           <p data-testid="pokemonType">{`${type}`}</p>
-          <p data-testid="pokemon-weight">{`Average weight:` + `${value}` + `${measurementUnit}`}</p>
+          <p data-testid="pokemon-weight">{"" + `${value}` + `${measurementUnit}`}</p>
           {showDetailsLink && <Link to={`pokemons/${id}`}>More details</Link>}
         </div>

[Killed] StringLiteral
sd-05-block15-project-react-testing-library/src/components/Pokemon.js:23:41
           <p data-testid="pokemon-name">{`${name}`}</p>
           <p data-testid="pokemonType">{`${type}`}</p>
           <p data-testid="pokemon-weight">{`Average weight:` + `${value}` + `${measurementUnit}`}</p>
-          {showDetailsLink && <Link to={`pokemons/${id}`}>More details</Link>}
+          {showDetailsLink && <Link to={""}>More details</Link>}
         </div>
         <img src={`${image}`} alt={`${name} sprite`} />

[Killed] StringLiteral
sd-05-block15-project-react-testing-library/src/components/Pokemon.js:30:31
           <img
             className="favorite-icon"
             src={`/star-icon.svg`}
-            alt={`${name} ` + `is marked as favorite`}
+            alt={`${name} ` + ""}
           />
         )}
